title: Suspicious LOLBin Execution From User Writable Path
id: df-local-0001
status: test
description: Detects common Windows living-off-the-land binaries launched from user writable paths or with suspicious command-line patterns.
references:
  - https://attack.mitre.org/techniques/T1218/
author: MetaSec Security Center
date: 2026/06/09
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1218
logsource:
  product: windows
  category: process_creation
detection:
  selection_image:
    Image|endswith:
      - \regsvr32.exe
      - \rundll32.exe
      - \mshta.exe
      - \installutil.exe
      - \wmic.exe
  selection_command:
    CommandLine|contains:
      - AppData
      - Temp
      - http
      - "javascript:"
      - scrobj.dll
  condition: selection_image and selection_command
falsepositives:
  - Administrative scripts and software deployment tools
level: high
