title: LOLBin Process Creation
id: golden-0001
status: test
description: Detects suspicious LOLBin execution.
tags:
  - attack.defense_evasion
  - attack.execution
  - attack.t1218
logsource:
  product: windows
  category: process_creation
detection:
  selection_image:
    Image|endswith:
      - \regsvr32.exe
      - \rundll32.exe
      - \mshta.exe
  selection_cli:
    CommandLine|contains:
      - scrobj.dll
      - http
  condition: selection_image and selection_cli
level: high
