{"id":"golden-0001","rule_id":"golden-0001","type":"query","language":"kuery","query":"event.category:\"process\" and ((process.executable : \"*\\\\regsvr32.exe\" or process.executable : \"*\\\\rundll32.exe\" or process.executable : \"*\\\\mshta.exe\") and (process.command_line : \"*scrobj.dll*\" or process.command_line : \"*http*\"))","name":"MetaSec Security Center - LOLBin Process Creation","description":"Detects suspicious LOLBin execution.","severity":"high","risk_score":73,"interval":"5m","from":"now-9m","to":"now","index":["logs-*","winlogbeat-*","logs-windows.*","logs-endpoint.events.*"],"enabled":true,"tags":["MetaSec Security Center","Tactic: Defense Evasion","Tactic: Execution","T1218"],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1218","name":"System Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1218","name":"System Binary Proxy Execution","reference":"https://attack.mitre.org/techniques/T1218/"}]}],"max_signals":100,"references":[]}
