DeviceProcessEvents | where ((ProcessCommandLine contains "-encodedcommand" or ProcessCommandLine contains "/encodedcommand" or ProcessCommandLine contains "–encodedcommand" or ProcessCommandLine contains "—encodedcommand") and FolderPath endswith "\\powershell.exe")
